balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F4011.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="NVMADR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="NVMADR" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMADR" edc:desc="" edc:mask="0xffff" edc:name="NVMADR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="NVMADRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMADRU" edc:nzwidth="0x10" edc:por="--------xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMADR" edc:desc="" edc:mask="0xff" edc:name="NVMADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------wwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMKEY" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="KEY" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="KEY" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnnnn-nnn-n-nn" edc:cname="PMD1" edc:desc="" edc:impl="0xfeeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000-000-0-00" edc:name="PMD1" edc:nzwidth="0x10" edc:por="0000000-000-0-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1MD" edc:desc="" edc:mask="0x1" edc:name="C1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CMD" edc:desc="" edc:mask="0x1" edc:name="I2CMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWMMD" edc:desc="" edc:mask="0x1" edc:name="PWMMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIMD" edc:desc="" edc:mask="0x1" edc:name="QEIMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn----nnnn" edc:cname="PMD2" edc:desc="" edc:impl="0xc30f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00----0000" edc:name="PMD2" edc:nzwidth="0x10" edc:por="00----00----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IC7MD" edc:desc="" edc:mask="0x1" edc:name="IC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC8MD" edc:desc="" edc:mask="0x1" edc:name="IC8MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd0028" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x1000" edc:regionid="data"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="EMUD3"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="Vref+"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="EMUC3"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="Vref-"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="SS1"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="INDX"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="QEA"/>
      <edc:VirtualPin edc:name="IC7"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="QEB"/>
      <edc:VirtualPin edc:name="IC8"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="OCFA"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="EMUD1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="T2CK"/>
      <edc:VirtualPin edc:name="U1ATX"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="EMUC1"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="U1ARX"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="FLTA"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RE8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="EMUD2"/>
      <edc:VirtualPin edc:name="OC2"/>
      <edc:VirtualPin edc:name="IC2"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="OC4"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="OC3"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="EMUC2"/>
      <edc:VirtualPin edc:name="OC1"/>
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="RD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="PGD"/>
      <edc:VirtualPin edc:name="EMUD"/>
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="RF3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="PGC"/>
      <edc:VirtualPin edc:name="EMUC"/>
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="SDA"/>
      <edc:VirtualPin edc:name="RF2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="U2TX"/>
      <edc:VirtualPin edc:name="RF5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="U2RX"/>
      <edc:VirtualPin edc:name="RF4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="C1TX"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="C1RX"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="PWM3H"/>
      <edc:VirtualPin edc:name="RE5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="PWM3L"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="PWM2H"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="PWM2L"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="PWM1H"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="PWM1L"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="AVss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="AVdd"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>